In [1]:
# import sqlite3
import sqlite3
 
def create_connection(db_file):
    """ create a database connection to the SQLite database
        specified by the db_file
    :param db_file: database file
    :return: Connection object or None
    """
    conn = None
    try:
        conn = sqlite3.connect(db_file)
        print(sqlite3.version)
    except Error as e:
        print(e)
 
    return conn
 
def select_all_tasks(conn):
    """
    Query all rows in the tasks table
    :param conn: the Connection object
    :return:
    """
    cur = conn.cursor()
    
    query1 = """
        SELECT *
        FROM FACILITIES
        """
    cur.execute(query1)
 
    rows = cur.fetchall()
 
    for row in rows:
        print(row)


def main():
    database = "sqlite_db_pythonsqlite.db"
 
    # create a database connection
    conn = create_connection(database)
    with conn: 
        print("2. Query all tasks")
        select_all_tasks(conn)
 
 
if __name__ == '__main__':
    main()

2.6.0
2. Query all tasks
(0, 'Tennis Court 1', 5, 25, 10000, 200)
(1, 'Tennis Court 2', 5, 25, 8000, 200)
(2, 'Badminton Court', 0, 15.5, 4000, 50)
(3, 'Table Tennis', 0, 5, 320, 10)
(4, 'Massage Room 1', 9.9, 80, 4000, 3000)
(5, 'Massage Room 2', 9.9, 80, 4000, 3000)
(6, 'Squash Court', 3.5, 17.5, 5000, 80)
(7, 'Snooker Table', 0, 5, 450, 15)
(8, 'Pool Table', 0, 5, 400, 15)

In [31]:
import pandas as pd
from sqlalchemy import create_engine
conn = sqlite3.connect("sqlite_db_pythonsqlite.db")

Question10 = "SELECT f.name,\
            CASE WHEN b.memid = 0 THEN SUM(b.slots * f.guestcost)ELSE sum(b.slots * f.membercost) END AS Revenue\
            FROM Bookings as b\
            LEFT JOIN Facilities AS f\
            ON b.facid = f.facid\
            GROUP BY b.facid\
            HAVING Revenue < 1000\
            ORDER BY Revenue DESC"

rs = conn.execute(Question10)
df_Question10 = pd.DataFrame(rs.fetchall())
print(df_Question10)

                 0  1
0       Pool Table  0
1    Snooker Table  0
2     Table Tennis  0
3  Badminton Court  0

In [35]:
Question11 = "SELECT m1. firstname || ' ' || m1.surname as member, m1.recommendedby,\
            m2.firstname || ' ' || m2.surname as ReccomendedBy\
            FROM Members as m1\
            INNER JOIN Members as m2\
            ON  m1.recommendedby = m2.memid\
            WHERE m2.firstname <> 'GUEST'\
            ORDER BY m1.surname, m1.firstname"
rs = conn.execute(Question11)
df_Question11 = pd.DataFrame(rs.fetchall())
print(df_Question11)

                          0   1                  2
0            Florence Bader   9    Ponder Stibbons
1                Anne Baker   9    Ponder Stibbons
2             Timothy Baker  13     Jemima Farrell
3                Tim Boothe   3         Tim Rownam
4            Gerald Butters   1       Darren Smith
5               Joan Coplin  16      Timothy Baker
6             Erica Crumpet   2        Tracy Smith
7                Nancy Dare   4    Janice Joplette
8           Matthew Genting   5     Gerald Butters
9                 John Hunt  30  Millicent Purview
10              David Jones   4    Janice Joplette
11            Douglas Jones  11        David Jones
12          Janice Joplette   1       Darren Smith
13           Anna Mackenzie   1       Darren Smith
14             Charles Owen   1       Darren Smith
15             David Pinker  13     Jemima Farrell
16        Millicent Purview   2        Tracy Smith
17         Henrietta Rumney  20    Matthew Genting
18         Ramnaresh Sarwin  15     Florence Bader
19               Jack Smith   1       Darren Smith
20          Ponder Stibbons   6       Burton Tracy
21  Henry Worthington-Smyth   2        Tracy Smith

In [39]:
Question12 = "SELECT f.name, m.surname, m.firstname, COUNT(*) as TotalBookings\
            FROM Bookings as b\
            LEFT JOIN Facilities as f\
            ON b.facid = f.facid\
            LEFT JOIN Members as m\
            ON b.memid = m.memid\
            WHERE b.memid <> 0\
            GROUP BY f.name, m.memid"

rs = conn.execute(Question12)
df_Question12 = pd.DataFrame(rs.fetchall())
print(df_Question12)

                   0        1          2    3
0    Badminton Court    Smith     Darren  132
1    Badminton Court    Smith      Tracy   32
2    Badminton Court   Rownam        Tim    4
3    Badminton Court  Butters     Gerald   20
4    Badminton Court    Tracy     Burton    2
..               ...      ...        ...  ...
197   Tennis Court 2   Sarwin  Ramnaresh   11
198   Tennis Court 2   Rumney  Henrietta    1
199   Tennis Court 2  Farrell      David    1
200   Tennis Court 2  Purview  Millicent    1
201   Tennis Court 2     Hunt       John    4

[202 rows x 4 columns]

In [46]:
Question13 = "SELECT f.name, COUNT(b.memid),strftime('%m', b.starttime) as BookMonth\
            FROM Bookings as b\
            LEFT JOIN Facilities as f\
            ON b.facid = f.facid\
            LEFT JOIN Members as m\
            ON b.memid = m.memid\
            WHERE b.memid <> 0\
            GROUP BY f.name, BookMonth\
            ORDER BY f.name"

rs = conn.execute(Question13)
df_Question13 = pd.DataFrame(rs.fetchall())
print(df_Question13)

                  0    1   2
0   Badminton Court   51  07
1   Badminton Court  132  08
2   Badminton Court  161  09
3    Massage Room 1   77  07
4    Massage Room 1  153  08
5    Massage Room 1  191  09
6    Massage Room 2    4  07
7    Massage Room 2    9  08
8    Massage Room 2   14  09
9        Pool Table  103  07
10       Pool Table  272  08
11       Pool Table  408  09
12    Snooker Table   68  07
13    Snooker Table  154  08
14    Snooker Table  199  09
15     Squash Court   23  07
16     Squash Court   85  08
17     Squash Court   87  09
18     Table Tennis   48  07
19     Table Tennis  143  08
20     Table Tennis  194  09
21   Tennis Court 1   65  07
22   Tennis Court 1  111  08
23   Tennis Court 1  132  09
24   Tennis Court 2   41  07
25   Tennis Court 2  109  08
26   Tennis Court 2  126  09